# Space_Set3DGrossHeightOffset

## Description
Set the gross offset height of 3D space object.

```pascal
PROCEDURE Space_Set3DGrossHeightOffset(
				space  : HANDLE;
				offset : REAL;
				selObj : BOOLEAN);
```

```python
def vs.Space_Set3DGrossHeightOffset(space, offset, selObj):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|space|HANDLE|   |
|offset|REAL|   |
|selObj|BOOLEAN|   |

## Version
Availability: from Vectorworks 2014

## Category
* SpaceObjectCoreTools